for i in [1, 2, 3, 4, 5]:
    print(i)# вывод цифр из списка в столбик.
for i in range (4):
    print (i)
    S = 0  # заводим переменную счетчик, в которой мы будем считать сумму
    N = 5

    # заводим цикл for в котором мы будем проходить по всем числам от одного до N
    for i in range(1, N + 1):  # равносильно выражению for i in [1, 2, 3, ... , N -1, N]:
        print("Значение суммы на предыдущем шаге: ", S)
        print("Текущее число: ", i)
        S = S + i  # cуммируем текущее число i и перезаписываем значение суммы
        print("Значение суммы после сложения: ", S)
        print("---")
    print("Конец цикла")
    print()
    print("Ответ: сумма равна = ", S)
    # задание просчитать сумму произведение всех чисел от 1 до N включительно
n = 0
m = 5
for n in range(0.6):
    n = n + 1
    print (n)
    https: // www.youtube.com / watch?v = yPUA8xBEyzM & list = RDCMUCMcC_43zGHttf9bY - xJOTwA & index\0= 4


a = [1, "Чёрт знает, что",5]
for x in a:
    print (x)# список он разобьёт по элементам списка, но строку (простую строку из букв)-он разобьёт по буквам!!
    